{"class_name": "Functional", "config": {"name": "FaceRecoModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 96, 96], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_3"}, "name": "input_3", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_46", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_first"}, "name": "zero_padding2d_46", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1", "inbound_nodes": [[["zero_padding2d_46", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1", "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_74", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_74", "inbound_nodes": [[["bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_47", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_47", "inbound_nodes": [[["activation_74", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_12", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "max_pooling2d_12", "inbound_nodes": [[["zero_padding2d_47", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2", "inbound_nodes": [[["max_pooling2d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn2", "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_75", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_75", "inbound_nodes": [[["bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_48", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_48", "inbound_nodes": [[["activation_75", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv3", "inbound_nodes": [[["zero_padding2d_48", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn3", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn3", "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_76", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_76", "inbound_nodes": [[["bn3", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_49", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_49", "inbound_nodes": [[["activation_76", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_13", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "max_pooling2d_13", "inbound_nodes": [[["zero_padding2d_49", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_3x3_conv1", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_5x5_conv1", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_3x3_bn1", "inbound_nodes": [[["inception_3a_3x3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_5x5_bn1", "inbound_nodes": [[["inception_3a_5x5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_77", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_77", "inbound_nodes": [[["inception_3a_3x3_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_79", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_79", "inbound_nodes": [[["inception_3a_5x5_bn1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_14", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "max_pooling2d_14", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_50", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_50", "inbound_nodes": [[["activation_77", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_51", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_51", "inbound_nodes": [[["activation_79", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_pool_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_pool_conv", "inbound_nodes": [[["max_pooling2d_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_3x3_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_3x3_conv2", "inbound_nodes": [[["zero_padding2d_50", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_5x5_conv2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_5x5_conv2", "inbound_nodes": [[["zero_padding2d_51", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_pool_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_pool_bn", "inbound_nodes": [[["inception_3a_pool_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3a_1x1_conv", "inbound_nodes": [[["max_pooling2d_13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_3x3_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_3x3_bn2", "inbound_nodes": [[["inception_3a_3x3_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_5x5_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_5x5_bn2", "inbound_nodes": [[["inception_3a_5x5_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_81", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_81", "inbound_nodes": [[["inception_3a_pool_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3a_1x1_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3a_1x1_bn", "inbound_nodes": [[["inception_3a_1x1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_78", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_78", "inbound_nodes": [[["inception_3a_3x3_bn2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_80", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_80", "inbound_nodes": [[["inception_3a_5x5_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_52", "trainable": true, "dtype": "float32", "padding": [[3, 4], [3, 4]], "data_format": "channels_first"}, "name": "zero_padding2d_52", "inbound_nodes": [[["activation_81", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_82", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_82", "inbound_nodes": [[["inception_3a_1x1_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_14", "inbound_nodes": [[["activation_78", 0, 0, {}], ["activation_80", 0, 0, {}], ["zero_padding2d_52", 0, 0, {}], ["activation_82", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_3x3_conv1", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_5x5_conv1", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_3x3_bn1", "inbound_nodes": [[["inception_3b_3x3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_5x5_bn1", "inbound_nodes": [[["inception_3b_5x5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_83", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_83", "inbound_nodes": [[["inception_3b_3x3_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_85", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_85", "inbound_nodes": [[["inception_3b_5x5_bn1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_8", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "name": "average_pooling2d_8", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_53", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_53", "inbound_nodes": [[["activation_83", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_54", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_54", "inbound_nodes": [[["activation_85", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_pool_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_pool_conv", "inbound_nodes": [[["average_pooling2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_3x3_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_3x3_conv2", "inbound_nodes": [[["zero_padding2d_53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_5x5_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_5x5_conv2", "inbound_nodes": [[["zero_padding2d_54", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_pool_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_pool_bn", "inbound_nodes": [[["inception_3b_pool_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3b_1x1_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3b_1x1_conv", "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_3x3_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_3x3_bn2", "inbound_nodes": [[["inception_3b_3x3_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_5x5_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_5x5_bn2", "inbound_nodes": [[["inception_3b_5x5_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_87", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_87", "inbound_nodes": [[["inception_3b_pool_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3b_1x1_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3b_1x1_bn", "inbound_nodes": [[["inception_3b_1x1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_84", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_84", "inbound_nodes": [[["inception_3b_3x3_bn2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_86", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_86", "inbound_nodes": [[["inception_3b_5x5_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_55", "trainable": true, "dtype": "float32", "padding": [[4, 4], [4, 4]], "data_format": "channels_first"}, "name": "zero_padding2d_55", "inbound_nodes": [[["activation_87", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_88", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_88", "inbound_nodes": [[["inception_3b_1x1_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_15", "inbound_nodes": [[["activation_84", 0, 0, {}], ["activation_86", 0, 0, {}], ["zero_padding2d_55", 0, 0, {}], ["activation_88", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3c_3x3_conv1", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3c_5x5_conv1", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3c_3x3_bn1", "inbound_nodes": [[["inception_3c_3x3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3c_5x5_bn1", "inbound_nodes": [[["inception_3c_5x5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_89", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_89", "inbound_nodes": [[["inception_3c_3x3_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_91", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_91", "inbound_nodes": [[["inception_3c_5x5_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_56", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_56", "inbound_nodes": [[["activation_89", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_57", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_57", "inbound_nodes": [[["activation_91", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3c_3x3_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3c_3x3_conv2", "inbound_nodes": [[["zero_padding2d_56", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_3c_5x5_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_3c_5x5_conv2", "inbound_nodes": [[["zero_padding2d_57", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3c_3x3_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3c_3x3_bn2", "inbound_nodes": [[["inception_3c_3x3_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_3c_5x5_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_3c_5x5_bn2", "inbound_nodes": [[["inception_3c_5x5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_15", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "max_pooling2d_15", "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_90", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_90", "inbound_nodes": [[["inception_3c_3x3_bn2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_92", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_92", "inbound_nodes": [[["inception_3c_5x5_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_58", "trainable": true, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_58", "inbound_nodes": [[["max_pooling2d_15", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_16", "inbound_nodes": [[["activation_90", 0, 0, {}], ["activation_92", 0, 0, {}], ["zero_padding2d_58", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv1", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_3x3_conv1", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_5x5_conv1", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_3x3_bn1", "inbound_nodes": [[["inception_4a_3x3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_5x5_bn1", "inbound_nodes": [[["inception_4a_5x5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_93", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_93", "inbound_nodes": [[["inception_4a_3x3_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_95", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_95", "inbound_nodes": [[["inception_4a_5x5_bn1", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_9", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [3, 3], "data_format": "channels_first"}, "name": "average_pooling2d_9", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_59", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_59", "inbound_nodes": [[["activation_93", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_60", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_60", "inbound_nodes": [[["activation_95", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_pool_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_pool_conv", "inbound_nodes": [[["average_pooling2d_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_3x3_conv2", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_3x3_conv2", "inbound_nodes": [[["zero_padding2d_59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_5x5_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_5x5_conv2", "inbound_nodes": [[["zero_padding2d_60", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_pool_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_pool_bn", "inbound_nodes": [[["inception_4a_pool_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4a_1x1_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4a_1x1_conv", "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_3x3_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_3x3_bn2", "inbound_nodes": [[["inception_4a_3x3_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_5x5_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_5x5_bn2", "inbound_nodes": [[["inception_4a_5x5_conv2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_97", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_97", "inbound_nodes": [[["inception_4a_pool_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4a_1x1_bn", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4a_1x1_bn", "inbound_nodes": [[["inception_4a_1x1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_94", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_94", "inbound_nodes": [[["inception_4a_3x3_bn2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_96", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_96", "inbound_nodes": [[["inception_4a_5x5_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_61", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_61", "inbound_nodes": [[["activation_97", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_98", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_98", "inbound_nodes": [[["inception_4a_1x1_bn", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": 1}, "name": "concatenate_17", "inbound_nodes": [[["activation_94", 0, 0, {}], ["activation_96", 0, 0, {}], ["zero_padding2d_61", 0, 0, {}], ["activation_98", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv1", "trainable": true, "dtype": "float32", "filters": 160, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4e_3x3_conv1", "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4e_5x5_conv1", "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4e_3x3_bn1", "inbound_nodes": [[["inception_4e_3x3_conv1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4e_5x5_bn1", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "inception_4e_5x5_bn1", "inbound_nodes": [[["inception_4e_5x5_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_99", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_99", "inbound_nodes": [[["inception_4e_3x3_bn1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_101", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_101", "inbound_nodes": [[["inception_4e_5x5_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_62", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "zero_padding2d_62", "inbound_nodes": [[["activation_99", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_63", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "zero_padding2d_63", "inbound_nodes": [[["activation_101", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4e_3x3_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4e_3x3_conv2", "inbound_nodes": [[["zero_padding2d_62", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "inception_4e_5x5_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "inception_4e_5x5_conv2", "inbound_nodes": [[["zero_padding2d_63", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "inception_4e_3x3_bn2", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 1e-05, "center": 